{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "activation": "linear", "name": "convolution2d_1", "init": "glorot_uniform", "b_regularizer": null, "batch_input_shape": [null, 64, 96, 3], "W_regularizer": null, "trainable": true, "W_constraint": null, "nb_row": 1, "b_constraint": null, "border_mode": "same", "activity_regularizer": null, "nb_filter": 1, "nb_col": 1, "input_dtype": "float32", "subsample": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"bias": true, "activation": "linear", "name": "convolution2d_2", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": {"l1": 0.0, "l2": 0.009999999776482582, "name": "L1L2Regularizer"}, "trainable": true, "W_constraint": null, "nb_row": 3, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_filter": 24, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"bias": true, "activation": "linear", "name": "convolution2d_3", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "nb_row": 3, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_filter": 36, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"bias": true, "activation": "linear", "name": "convolution2d_4", "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null, "trainable": true, "W_constraint": null, "nb_row": 3, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null, "nb_filter": 48, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3", "pool_size": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "linear", "trainable": true, "init": "uniform", "input_dim": 2880, "name": "dense_1", "b_regularizer": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 100, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_4"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "linear", "trainable": true, "init": "uniform", "input_dim": 100, "name": "dense_2", "b_regularizer": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 100, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_5"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "linear", "trainable": true, "init": "uniform", "input_dim": 100, "name": "dense_3", "b_regularizer": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "W_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_6"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "activation": "linear", "trainable": true, "init": "glorot_uniform", "input_dim": 10, "name": "dense_4", "b_regularizer": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "W_constraint": null}}]}