{"keras_version": "1.2.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_1", "batch_input_shape": [null, 64, 96, 3], "border_mode": "same", "input_dtype": "float32", "nb_col": 1, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 1, "nb_row": 1, "activation": "linear", "b_constraint": null, "b_regularizer": null}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_2", "border_mode": "valid", "nb_col": 3, "W_regularizer": {"name": "L1L2Regularizer", "l2": 0.009999999776482582, "l1": 0.0}, "subsample": [1, 1], "nb_filter": 24, "nb_row": 3, "activation": "linear", "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "elu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_3", "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 36, "nb_row": 3, "activation": "linear", "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "elu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "W_constraint": null, "activity_regularizer": null, "name": "convolution2d_4", "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "subsample": [1, 1], "nb_filter": 48, "nb_row": 3, "activation": "linear", "b_constraint": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "elu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"bias": true, "init": "uniform", "trainable": true, "W_constraint": null, "activity_regularizer": null, "input_dim": 2880, "name": "dense_1", "output_dim": 100, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"bias": true, "init": "uniform", "trainable": true, "W_constraint": null, "activity_regularizer": null, "input_dim": 100, "name": "dense_2", "output_dim": 100, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"bias": true, "init": "uniform", "trainable": true, "W_constraint": null, "activity_regularizer": null, "input_dim": 100, "name": "dense_3", "output_dim": 10, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "b_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "elu"}}, {"class_name": "Dense", "config": {"bias": true, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "activity_regularizer": null, "input_dim": 10, "name": "dense_4", "output_dim": 1, "W_regularizer": null, "b_regularizer": null, "activation": "linear", "b_constraint": null}}]}